app/views/projects/index.html.erb

				<td><%= link_to project.name, project_path(project) %></td>
				<td><%= project.materials.distinct.size  %></td>
---
SELECT "materials".* FROM "materials" INNER JOIN "project_materials" ON "materials"."id" = "project_materials"."material_id" WHERE "project_materials"."project_id" = ?  [["project_id", 1]]