app/views/projects/show.html.erb

	<div class='page-header'>
		<h4>Materials needed - <%= @project.materials.distinct.size %></h4>
---
SELECT "materials".* FROM "materials" INNER JOIN "project_materials" ON "materials"."id" = "project_materials"."material_id" WHERE "project_materials"."project_id" = ?  [["project_id", 4]]