app/views/workers/index.html.erb

				<td><%= user.expertise_level || '<span class="text-danger">Not specified</span>'.html_safe  %></td>
				<td><%= user.projects.size  %></td>
---
SELECT COUNT(*) FROM "projects" INNER JOIN "project_employees" ON "projects"."id" = "project_employees"."project_id" WHERE "project_employees"."user_id" = ?  [["user_id", 9]]