app/controllers/materials_controller.rb

SELECT  "materials".* FROM "materials"  ORDER BY "materials"."name" ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "materials"
---
  def index
    @materials = Material.all.order(:name).paginate(page: params[:page])