app/controllers/projects_controller.rb

  def index
    @projects = Project.all.order(:name).paginate(page: params[:page])
---
SELECT  "projects".* FROM "projects"  ORDER BY "projects"."name" ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "projects"

  def create
    Project.create project_params
---
INSERT INTO "projects" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["description", ""], ["created_at", "2016-11-05 13:17:53.096395"], ["updated_at", "2016-11-05 13:17:53.096395"]]

  def add_material
    if params[:material_id].present?
      begin
        material = Material.find(params[:material_id])
        if @project.project_materials.where(:material_id => material.id).size > 0
          flash[:warning] = "Material '#{material.name}' already added to project"
        else
          @project.materials << material
---
SELECT  "materials".* FROM "materials" WHERE "materials"."id" = ? LIMIT 1  [["id", 7]]
SELECT COUNT(*) FROM "project_materials" WHERE "project_materials"."project_id" = ? AND "project_materials"."material_id" = ?  [["project_id", 4], ["material_id", 7]]
INSERT INTO "project_materials" ("project_id", "material_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 4], ["material_id", 7], ["created_at", "2016-11-05 20:41:20.668497"], ["updated_at", "2016-11-05 20:41:20.668497"]]

  def add_worker
    if params[:worker_id].present?
      begin
        user = User.find(params[:worker_id])
        if @project.project_employees.where(:user_id => user.id).size > 0
          flash[:warning] = "Worker '#{user.name}' already added to project"
        else
          @project.employees << user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 3]]
SELECT COUNT(*) FROM "project_employees" WHERE "project_employees"."project_id" = ? AND "project_employees"."user_id" = ?  [["project_id", 4], ["user_id", 3]]
INSERT INTO "project_employees" ("project_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["project_id", 4], ["user_id", 3], ["created_at", "2016-11-05 20:41:43.499562"], ["updated_at", "2016-11-05 20:41:43.499562"]]