app/controllers/workers_controller.rb

  def index
    @users = User.all.order(:name).paginate(page: params[:page])
---
SELECT  "users".* FROM "users"  ORDER BY "users"."name" ASC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    if User.where(:email => user_params[:email]).size > 0
---
SELECT COUNT(*) FROM "users" WHERE "users"."email" = ?  [["email", "test@test.com"]]