app/views/materials/index.html.erb

SELECT COUNT(*) FROM "projects" INNER JOIN "project_materials" ON "projects"."id" = "project_materials"."project_id" WHERE "project_materials"."material_id" = ?  [["material_id", 2]]
---
				<td><%= ((material.dimensions.present? and material.dimensions.size > 0) ? material.dimensions : 'Not specified')  %></td>
				<td><%= material.projects.size  %></td>